//DANUITY  JOB  1,NOTIFY=&SYSUID
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..COBOL.CBL(ANNUITY),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD(ANNUITY),DISP=SHR
//GO       EXEC PGM=ANNUITY
//STEPLIB      DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
