//DMORT  JOB  1,NOTIFY=&SYSUID
//COBRUN   EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..COBOL.CBL(MORTGAGE),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD(MORTGAGE),DISP=SHR
//GO       EXEC PGM=MORTGAGE,PARM='HTML'
//INDATA       DD DSN=S990069.MORTGAGE,DISP=SHR
//REOUPUT       DD DSN=S990069.OUTPUT(HTML),DISP=OLD
//OUTPUT       DD SYSOUT=*
//STEPLIB      DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
